<!doctype html>
<html lang="zh-CN">
<head>

    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <title>Windows内核开发总结(一) | 菠萝蜜</title>
    <meta property="og:title" content="Windows内核开发总结(一) - 菠萝蜜">
    <meta property="og:type" content="article">
        
    <meta property="article:published_time" content='2019-12-23T09:16:34&#43;08:00'>
        
        
    <meta property="article:modified_time" content='2019-12-23T09:16:34&#43;08:00'>
        
    <meta name="Keywords" content="C/C&#43;&#43;, GPU, Windows驱动开发, OpenCV, 图像处理">
    <meta name="description" content="Windows内核开发总结(一)">
        
    <meta name="author" content="Binean">
    <meta property="og:url" content="https://bzhou830.github.io/post/20191223WindowsKernelProgramingSummer01/">
    <link rel="shortcut icon" href="/image/favicon.ico" type="image/x-icon">
    <link rel="stylesheet" href='/css/normalize.css'>
    
    <link rel="stylesheet" href="/css/prism.css">
    
    <link rel="stylesheet" href='/css/style.css'>
    <script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.4.1/jquery.min.js"></script>

    


    
    
</head>


<body>
    <header id="header" class="clearfix">
    <div class="container">
        <div class="col-group">
            <div class="site-name ">
                
                    <a id="logo" href="https://bzhou830.github.io/">

        text-transform: uppercase;
        text-align: center;
    }

    .post-toc .post-toc-content {
        font-size: 15px;
    }

    .post-toc .post-toc-content>nav>ul {
        margin: 10px 0;
    }

    .post-toc .post-toc-content ul {
        padding-left: 20px;
        list-style: square;
        margin: 0.5em;
        line-height: 1.8em;
    }

    .post-toc .post-toc-content ul ul {
        padding-left: 15px;
        display: none;
    }

    @media print,
    screen and (max-width:1057px) {
        .post-toc {
            display: none;
        }
    }
</style>
<div class="post-toc" style="position: absolute; top: 188px;">
    <h2 class="post-toc-title">文章目录</h2>
    <div class="post-toc-content">
        <nav id="TableOfContents">
  <ul>
    <li><a href="#1-windows内核对象">1. windows内核对象</a></li>
    <li><a href="#2-r3层加载驱动的另一种方式">2. R3层加载驱动的另一种方式</a></li>
    <li><a href="#3-应用层驱动一般通信方式">3. 应用层驱动一般通信方式</a></li>
    <li><a href="#4-驱动对象和设备对象及设备对象扩展">4. 驱动对象和设备对象及设备对象扩展</a></li>
    <li><a href="#5-驱动下的对象操作及内存分配">5. 驱动下的对象操作及内存分配</a></li>
    <li><a href="#6-常用驱动系统api使用">6. 常用驱动系统API使用</a></li>
    <li><a href="#7-内核线程及同步问题">7. 内核线程及同步问题</a></li>
  </ul>
</nav>
    </div>
</div>
<script type="text/javascript">
    $(document).ready(function () {
        var postToc = $(".post-toc");
        if (postToc.length) {
            var leftPos = $("#main").offset().left;
            if(leftPos<220){
                postToc.css({"width":leftPos-10,"margin-left":(0-leftPos)})
            }

            var t = postToc.offset().top - 20,
                a = {
                    start: {
                        position: "absolute",
                        top: t
                    },
                    process: {
                        position: "fixed",
                        top: 20
                    },
                };
            $(window).scroll(function () {
                var e = $(window).scrollTop();
                e < t ? postToc.css(a.start) : postToc.css(a.process)
            })
        }
    })
</script>
    <article class="post">
        <header>
            <h1 class="post-title">Windows内核开发总结(一)</h1>
        </header>
        <date class="post-meta meta-date">
            2019年12月23日
        </date>
        
        <div class="post-meta">
            <span>|</span>
            
            <span class="meta-category"><a href='https://bzhou830.github.io/categories/WindowsKernel'>WindowsKernel</a></span>
            
        </div>
        
        
        <div class="post-meta">
            <span id="busuanzi_container_page_pv">|<span id="busuanzi_value_page_pv"></span><span>
                    阅读</span></span>
        </div>
        
        
        <div class="post-content">
            <h2 id="1-windows内核对象">1. windows内核对象</h2>
<p>每个对象都有对象头和对象体组成。所有类型的对象头结构都是相同的，而结构体部分却各不相同的。下面是内核对象的结构图：</p>
<p><img src="https://oser.space/img/driver1/1.jpg" alt="内核对象的结构图"></p>
<p>进程句柄表</p>
<pre><code class="language-cpp">dt nt!_EPROCESS
    +0x000 Pcb : _KPROCESS
    +0x06c ProcessLock : _EX_PUSH_LOCK
    +0x070 CreateTime : _LARGE_INTEGER
    +0x078 ExitTime : _LARGE_INTEGER
    +0x080 RundownProtect : _EX_RUNDOWN_REF
    +0x084 UniqueProcessId : Ptr32 Void
    +0x088 ActiveProcessLinks : _LIST_ENTRY
    +0x090 QuotaUsage : [3] Uint4B
    +0x09c QuotaPeak : [3] Uint4B
    +0x0a8 CommitCharge : Uint4B
    +0x0ac PeakVirtualSize : Uint4B
    +0x0b0 VirtualSize : Uint4B
    +0x0b4 SessionProcessLinks : _LIST_ENTRY
    +0x0bc DebugPort : Ptr32 Void
    +0x0c0 ExceptionPort : Ptr32 Void
    +0x0c4 ObjectTable : Ptr32 _HANDLE_TABLE
</code></pre>
<p>不同操作系统的进程以<code>HANDLE_TABLE</code>索引句柄有不同的算法实现
内核句柄和进程句柄不相同，内核句柄表在未导出变量PspCidTable中</p>
<h2 id="2-r3层加载驱动的另一种方式">2. R3层加载驱动的另一种方式</h2>
<ul>
<li>初始化注册表项<code>HKLM\System\CurrentControlSet\Services\[服务名]</code></li>
<li>未公开文档调用<code>zwloaddriver</code>(测试源码 R3DriverTest)</li>
<li>参考下面链接中的源码</li>
</ul>
<h2 id="3-应用层驱动一般通信方式">3. 应用层驱动一般通信方式</h2>
<ul>
<li>
<p><code>CreateFile</code>打开<code>symbollink</code>指向的设备对象获得句柄</p>
</li>
<li>
<p>用<code>DeviceIoControl</code>进程驱动通信</p>
</li>
<li>
<p>IOCTL自定义控制码,CTL_CODE定义如下</p>
</li>
</ul>
<pre><code class="language-cpp">  #define CTL_CODE(DeviceType, Function, Method, Access) (
    ((DeviceType) &lt;&lt; 16) | ((Access) &lt;&lt; 14) | ((Function) &lt;&lt; 2) | (Method)
  )
</code></pre>
<p>NT式驱动DeviceType为FILE_DEVICE_UNKNOWN
Function 一般取值范围为2048-4095
Method 按传递buffer传递方式如下：</p>
<ul>
<li>METHOD_BUFFERED <strong>R3层拷贝buffer到内核</strong></li>
<li>METHOD_IN_DIRECT <strong>R3层物理地址映射buffer到内核内存</strong></li>
<li>METHOD_OUT_DIRECT <strong>同上</strong></li>
<li>METHOD_NEITHER <strong>直接使用R3内存，需要try住</strong></li>
</ul>
<p>Access取值<code>FILE_ANY_ACCESS, FILE_READ_ACCESS, FILE_WRITE_ACCESS</code></p>
<h2 id="4-驱动对象和设备对象及设备对象扩展">4. 驱动对象和设备对象及设备对象扩展</h2>
<pre><code class="language-cpp">dt nt!_DRIVER_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x004 DeviceObject     : Ptr32 _DEVICE_OBJECT
   +0x008 Flags            : Uint4B
   +0x00c DriverStart      : Ptr32 Void
   +0x010 DriverSize       : Uint4B
   +0x014 DriverSection    : Ptr32 Void
   +0x018 DriverExtension  : Ptr32 _DRIVER_EXTENSION
   +0x01c DriverName       : _UNICODE_STRING
   +0x024 HardwareDatabase : Ptr32 _UNICODE_STRING
   +0x028 FastIoDispatch   : Ptr32 _FAST_IO_DISPATCH
   +0x02c DriverInit       : Ptr32     long
   +0x030 DriverStartIo    : Ptr32     void
   +0x034 DriverUnload     : Ptr32     void
   +0x038 MajorFunction    : [28] Ptr32     long
</code></pre>
<ul>
<li>DeviceObject 驱动会创建一个或多个设备对象，同一个驱动对象的设备对象是用链表链起的，最后一个设备对象指向空</li>
<li>DriverName 驱动名 \Driver[驱动名]</li>
<li>HardwareDataBase 注册表指向的硬件数据库名\REGISTRY\MACHINE\HARDWARE\DESCRIPTION\SYSTM</li>
<li>DriverStartIo StartIo串行化处理例程</li>
<li>DriverUnload 卸载驱动的回调</li>
<li>MajorFunction 处理IRP的派遣函数</li>
<li>FastIoDispatch 文件的快速Io处理，一般驱动不会涉及到</li>
</ul>
<pre><code class="language-cpp"> dt nt!_DEVICE_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   +0x004 ReferenceCount   : Int4B
   +0x008 DriverObject     : Ptr32 _DRIVER_OBJECT
   +0x00c NextDevice       : Ptr32 _DEVICE_OBJECT
   +0x010 AttachedDevice   : Ptr32 _DEVICE_OBJECT
   +0x014 CurrentIrp       : Ptr32 _IRP
   +0x018 Timer            : Ptr32 _IO_TIMER
   +0x01c Flags            : Uint4B
   +0x020 Characteristics  : Uint4B
   +0x024 Vpb              : Ptr32 _VPB
   +0x028 DeviceExtension  : Ptr32 Void
   +0x02c DeviceType       : Uint4B
   +0x030 StackSize        : Char
   +0x034 Queue            : __unnamed
   +0x05c AlignmentRequirement : Uint4B
   +0x060 DeviceQueue      : _KDEVICE_QUEUE
   +0x074 Dpc              : _KDPC
   +0x094 ActiveThreadCount : Uint4B
   +0x098 SecurityDescriptor : Ptr32 Void
   +0x09c DeviceLock       : _KEVENT
   +0x0ac SectorSize       : Uint2B
   +0x0ae Spare1           : Uint2B
   +0x0b0 DeviceObjectExtension : Ptr32 _DEVOBJ_EXTENSION
   +0x0b4 Reserved         : Ptr32 Void
</code></pre>
<ul>
<li>DrivefrObject 指向创建自身的驱动对象</li>
<li>NextDevice 指向下一个设备对象，同属一个驱动对象的设备</li>
<li>AttachedDevice 指向更高的栈设备对象</li>
<li>CurrentIrp 使用StartIo时指向的当前处理的IRP结构</li>
<li>Flags 不同缓冲模式及其他一些标志</li>
<li>DeviceExtension 自定义的设备扩展对象，一般用于保存或传递全局变量</li>
<li>DeviceType FILE_DEVICE_UNKNOWN</li>
<li>StackSize 多层驱动的栈层数，设备对象从高层传递到底层</li>
</ul>
<p>winobj查看我们创建的对象</p>
<p><img src="https://oser.space/img/driver1/2.jpg" alt="TestDriver设备对象"></p>
<p>如果是打开文件，CreateFile -&gt; NtCreateFile需要对文件名进行NT路径转换</p>
<h2 id="5-驱动下的对象操作及内存分配">5. 驱动下的对象操作及内存分配</h2>
<ul>
<li>分页与非分页内存</li>
</ul>
<p>驱动中的中断优先级如下</p>
<pre><code class="language-cpp">#define PASSIVE_LEVEL                             0
#define LOW_LEVEL                                 0
#define APC_LEVEL                                 1
#define DISPATCH_LEVEL                            2
...
#define PROFILE_LEVEL                             27
#define CLOCK1_LEVEL                              28
